## Introdução ao Pandas

* Vizualização e limpeza de dados
* Semelhante ao Excel

In [1]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [7]:
series = pd.Series(data=lista,index=labels)
series

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','URSS','China'])
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','China'])
ser2

USA        1
Germany    2
Italy      3
China      4
dtype: int64

# Fazer operações baseadas no índice

In [10]:
ser1 + ser2

China      8.0
Germany    4.0
Italy      NaN
URSS       NaN
USA        2.0
dtype: float64

## DATAFRAMES

In [11]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(data=np.random.randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [14]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [15]:
type(df['W'])

pandas.core.series.Series

# Pegar apenas certas colunas

In [17]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

# Adicionar uma nova coluna

In [36]:
df['new'] = df['W'] + df['Z']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

# Deletar uma COluna

In [37]:
df.drop('new',axis=1,inplace=True)

In [38]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

# Pegar apenas um elemento

In [39]:
df.loc['C','X']

0.07295967531703869

# Pegar apenas uma linha

In [40]:
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

# Pegar um intervalo de linhas e colunas utilizando os índices

In [41]:
df.loc[['D','E'],['X','Y','Z']]

          X         Y         Z
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

# Pegar um intervalo de linhas e colunas utilizando as posições

In [43]:
df.iloc[3:5,1:4]

          X         Y         Z
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

# Checar todos os valores do dataframe

In [44]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [45]:
bol = df > 0
df[bol]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

# Seleção condicional de uma série de dados: pegar os elementos que são > 0 e estão na coluna Y

In [56]:
bol = df['W']>0
df[bol]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

# Multiplas condições

In [64]:
df[(df['W']>0) & (df['Y']<-1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

# Setando uma nova coluna como index

In [65]:
df['Estado'] = 'SP RJ AM SC MG'.split()
df

          W         X         Y         Z Estado
A  0.302665  1.693723 -1.706086 -1.159119     SP
B -0.134841  0.390528  0.166905  0.184502     RJ
C  0.807706  0.072960  0.638787  0.329646     AM
D -0.497104 -0.754070 -0.943406  0.484752     SC
E -0.116773  1.901755  0.238127  1.996652     MG

In [69]:
df.set_index('Estado',inplace=True)

KeyError: "None of ['Estado'] are in the columns"

In [70]:
df

               W         X         Y         Z
Estado
SP      0.302665  1.693723 -1.706086 -1.159119
RJ     -0.134841  0.390528  0.166905  0.184502
AM      0.807706  0.072960  0.638787  0.329646
SC     -0.497104 -0.754070 -0.943406  0.484752
MG     -0.116773  1.901755  0.238127  1.996652

# Índices multiníveis

In [71]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [74]:
df = pd.DataFrame(data=np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [75]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [76]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [77]:
df.index.names = ['Grupo','Numero']

In [78]:
df

                     A         B
Grupo Numero
G1    1       0.147027 -0.479448
      2       0.558769  1.024810
      3      -0.925874  1.862864
G2    1      -1.133817  0.610478
      2       0.386030  2.084019
      3      -0.376519  0.230336

# Seleciona por level interno

In [79]:
df.xs(1, level='Numero')

              A         B
Grupo
G1     0.147027 -0.479448
G2    -1.133817  0.610478

# Dados ausentes

In [80]:
d = {'A': [1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [82]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Remove as linhas com elementos faltantes

In [86]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [92]:
# Remove as linhas com 2 elementos faltantes

In [91]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

# Preenche os valores de NaN com algum outro valor ou string

In [93]:
df.fillna(value='Fill na')

         A        B  C
0      1.0      5.0  1
1      2.0  Fill na  2
2  Fill na  Fill na  3

# Preenche o valor faltando com o último valor obtido

In [94]:
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

# Groupby: aplicando operações com condicional

In [95]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'], 
        'Nome': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [98]:
df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

# Agrupa por empresa

In [99]:
group = df.groupby('Empresa')

In [100]:
group

# Soma o total de venda por empresa

In [101]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

# Média de vendas por empresa

In [102]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

# Exibe uma série de dados estátisticos sobre o conjunto de dados

In [103]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Agrupa por nome e verifica o total de vendas da Amy

In [109]:
group = df.groupby('Nome')
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64

# Concatenar, Juntar e Mesclar DataFrames

In [110]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'], 
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},index=[0,1,2,3])

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'], 
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},index=[4,5,6,7])

df3 = pd.DataFrame({'A':['A8','A9','A10','A11'], 
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},index=[8,9,10,11])

# Concatenar: cola os DataFrames no eixo das colunas

In [111]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenar: cola os DataFrames no eixo das linhas

In [112]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [113]:
esquerda = pd.DataFrame({'key':['K0','K1','K2','K3'],
                         'A'  :['A0','A1','A2','A3'],
                         'B'  :['B0','B1','B2','B3']})

direita = pd.DataFrame({'key':['K0','K1','K2','K3'],
                         'C'  :['C0','C1','C2','C3'],
                         'D'  :['D0','D1','D2','D3']})

# Mesclar: une dois DataFrames que possuem uma coluna em comum como chave

In [117]:
pd.merge(esquerda,direita,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [123]:
esqu = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A'  :['A0','A1','A2','A3'],
                     'B'  :['B0','B1','B2','B3']})

dire = pd.DataFrame({'key':['K0','K1','K1','K4'],
                     'C'  :['C0','C1','C2','C3'],
                     'D'  :['D0','D1','D2','D3']})

# Merge left: pega todas as 'keys' da esquerda e encontra os correspondentes na direita

In [124]:
pd.merge(esqu,dire,how='left',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K1  A1  B1   C2   D2
3  K2  A2  B2  NaN  NaN
4  K3  A3  B3  NaN  NaN

# Merge right: pega todas as 'keys' da direita e encontra os correspondentes na esquerda

In [125]:
pd.merge(esqu,dire,how='right',on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K1   A1   B1  C2  D2
3  K4  NaN  NaN  C3  D3

# Merge outer: pega todas as 'keys' do total, esquerda e direita

In [126]:
pd.merge(esqu,dire,how='outer',on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K1   A1   B1   C2   D2
3  K2   A2   B2  NaN  NaN
4  K3   A3   B3  NaN  NaN
5  K4  NaN  NaN   C3   D3

# Merge inner: pega apenas as 'keys' que tem nos dois dataframes

In [127]:
pd.merge(esqu,dire,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K1  A1  B1  C2  D2

# Join: junta dois dataframes em colunas considerando os indices do primeiro DF

In [128]:
aux1 = pd.DataFrame({'A': ['A0','A1','A2'],
                     'B': ['B0','B1','B2']},
                     index=['K0','K1','K2'])

aux2 = pd.DataFrame({'C': ['C0','C1','C2'],
                     'D': ['D0','D1','D2']},
                     index=['K0','K2','K3'])

In [129]:
aux1.join(aux2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [130]:
aux1.join(aux2, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operações com DataFrames

# df.head(): para uma tabela grande, o 'head' apresenta apenas o começo dela

In [131]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444,555,666,444],
                   'col3': ['abc','def','ghi','xyz']})

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# df.unique(): valores únicos de uma determinada coluna

In [133]:
df['col2'].unique()

array([444, 555, 666])

# len(df['col2'].unique()) == df['col2'].nunique(): 'nunique' retorna o número de valores únicos daquela coluna

In [134]:
df['col2'].nunique()

3

# 'value_counts': lista os valores e a quantidade de vezes que o valor aparece (une o unique e nunique)

In [135]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

# Aplica uma determinada operação em todos os valores de uma coluna

In [136]:
def multiplyByTwo(x):
    return x*2

df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [137]:
df['col2'].apply(multiplyByTwo)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# Multiplicando todos os valores de uma coluna por 2 utilizando a função lambda

In [138]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# Lista as colunas do DF

In [139]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

# Ordenar o DF de acordo com alguma coluna específica

In [140]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# isnull: pergunta para o DF quais valores são nulos

In [141]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Importa tabelas de arquivos csv

In [148]:
df = pd.read_csv('exemplo.csv',sep=',')
df

   a  b  c  d
0  1  2  3  4
1  6  7  8  9
2 -1 -2  5  4
3  2  2  3  3

In [ ]:
# Exercício 1:

In [150]:
sal = pd.read_csv('Salaries.csv',sep=',')

In [152]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [153]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

# Qual é o "BasePay" médio?

In [167]:
sal[sal['BasePay'] != 'Not Provided']['BasePay'].apply(float).mean()

66325.44884050643

# Qual é a maior quantidade de "OvertimePay" no conjunto de dados?

In [171]:
sal[sal['BasePay'] != 'Not Provided']['BasePay'].apply(float).max()

319275.01

# Qual é o cargo de JOSEPH DRISCOLL?

In [177]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

# Quanto JOSEPH DRISCOLL ganha (contando os benefícios)?

In [185]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# Qual a pessoa mais bem paga (incluindo benefícios)?

In [184]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

# Qual o nome da pessoa paga mais baixa (incluindo beneficios)?

In [186]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# Qual foi a média BasePay de todos os funcionários por ano (2011-2014)?

In [206]:
sal = sal[sal['BasePay'] != 'Not Provided']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [211]:
sal['BasePay'] = sal['BasePay'].apply(float)

In [216]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

# Quantos JobTitles diferentes existem?

In [218]:
sal['JobTitle'].nunique()

2158

# Quais são os 5 principais empregos mais comuns?

In [237]:
sal['JobTitle'].value_counts().iloc[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# Quantos JobTitles foram representados por apenas uma pessoa em 2013?

In [243]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

# Quantas pessoas tem a palavra chefe em seu cargo?

In [257]:
sum(sal['JobTitle'].apply(lambda title: True if 'chief' in title.lower() else False))

627

# Bônus: Existe uma correlação entre o comprimento da sequência do JobTitle e o salário?

In [259]:
sal['JobTitleLength'] = sal['JobTitle'].apply(len)

In [266]:
sal[['JobTitleLength','TotalPayBenefits']].corr()

                  JobTitleLength  TotalPayBenefits
JobTitleLength           1.00000          -0.03692
TotalPayBenefits        -0.03692           1.00000